Тестовый/src/InformationRegisters/ТестовыйРегистр/ТестовыйРегистр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТестовыйРегистр</name>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Строка</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Склады</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Число</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовый/src/InformationRegisters/ТестовыйРегистр/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьРегистрТестовымиЗаписями () Экспорт

	ЗаполнитьРегистр();	

КонецПроцедуры

Процедура ОчиститьРегистрОтТестовыхЗаписей() Экспорт

	ОчиститьРегистр();	

КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции
//Заполняет Регистр сведений случайным набором записей
Процедура ЗаполнитьРегистр() 
	
	Записей = 100;
	
	НаборЗаписей = РегистрыСведений.ТестовыйРегистр.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Дата = ТекущаяДата();

	ГСЧисло = Новый ГенераторСлучайныхЧисел; 
	ГССтрока = Новый ГенераторСлучайныхПаролей;
	
	Для Запись = 0 по Записей Цикл;

		НоваяЗапись =  НаборЗаписей.Добавить();
		НоваяЗапись.Строка = ГССтрока.СлучайныйПароль(7);
		НоваяЗапись.Число = ГСЧисло.СлучайноеЧисло(1,99);
		НоваяЗапись.Дата = Дата;
		НоваяЗапись.ПометкаУдаления = ?(Запись%2=0,Истина,Ложь);
		
		Дата = Дата;//+1;
	КонецЦикла;	
	Попытка
		НачатьТранзакцию();
		
		НаборЗаписей.Записать();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Успешно записано "+Записей+" записей!";
		Сообщение.Сообщить();
		
		ЗафиксироватьТранзакцию();
	Исключение 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось записать "+Записей+" записей!";
		Сообщение.Сообщить();

	    ОтменитьТранзакцию();
	КонецПопытки;
		
	
КонецПроцедуры

// очищает регистр от записей с пометкой удаления
Процедура ОчиститьРегистр() 
	
    НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТестовыйРегистр.Строка КАК Строка,
			|	ТестовыйРегистр.Число КАК Число,
			|	ТестовыйРегистр.Дата КАК Дата,
			|	ТестовыйРегистр.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	РегистрСведений.ТестовыйРегистр КАК ТестовыйРегистр
			|ГДЕ
			|	ТестовыйРегистр.ПометкаУдаления";
		
		РезультатЗапроса = Запрос.Выполнить();
	
		Выборка = РезультатЗапроса.Выбрать();
		Число = Выборка.Количество();
		МенеджерЗаписи = РегистрыСведений.ТестовыйРегистр.СоздатьМенеджерЗаписи();
		
		СчетчикТел = 0;
		
		Пока Выборка.Следующий() Цикл

			МенеджерЗаписи.Строка = Выборка.Строка;
			МенеджерЗаписи.Число = Выборка.Число;
			МенеджерЗаписи.Дата = Выборка.Дата;

			МенеджерЗаписи.Удалить();
			СчетчикТел = СчетчикТел+1;
		КонецЦикла; 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Успешно удалено "+СчетчикТел+" записей!";
		Сообщение.Сообщить();
		
		ЗафиксироватьТранзакцию();
	Исключение 
		ЗаписьЖурналаРегистрации("Ошибка удаления",УровеньЖурналаРегистрации.Ошибка,,,"Ошибка удаления записей регистра сведений");
		ОтменитьТранзакцию();
	КонецПопытки;	
	
КонецПроцедуры

#КонецОбласти
